__all__ = [
    "HELP_TEMPLATE",
]

HELP_TEMPLATE = """
<b>Grand Headman MIREA был разработан как инструмент-помощник для старост.</b>


Каждый учебный день, в 07:00, бот рассылает студентам сообщение с опросом. В нем студент должен отметить,
на каких парах он обещает присутствовать.

<b>С помощью бота студент может:</b>
1. Отметить конкретные пары, на которые обещает прийти (на всех оставшихся студент будет "считаться" отсутствующим)
2. Отметить, что обещает прийти на все пары или будет отсутствовать весь день (с помощью одной кнопки)
3. Изменить свой выбор.
4. Узнать расписание на текущий и на следующий день.

Старосте допуступна команда <b>Узнать посещаемость</b>, с помощью которой он может получить информацию о
посещаемости группы на текущий момент.

Всем пользователям доступна команда <b>Профиль</b> - бот отправляет сообщение с информацией о студенте. Доступны несколько кнопок,
позволяющие редактировать поля профиля. На данный момент доступно редактирование имени, фамилии и даты рождения.

<b>ВНИМАНИЕ!!!</b> Бот все еще находится на стадии разработки, потому, к сожалению, пероидически могут возникать неполадки.
Если есть вопросы или предложения - вы можете написать их <b>сюда --->>> @noheadproblemsbot</b>. Мы действительно
читаем все, что вы пишете в бота обратной связи.
"""
