from datetime import datetime

__all__ = [
    "PARSE_RESULT",
]

PARSE_RESULT = {
    datetime(2023, 10, 1, 0, 0): [],
    datetime(2023, 10, 2, 0, 0): [("Процедурное ...", "09:00"), ("Процедурное ...", "10:40")],
    datetime(2023, 10, 3, 0, 0): [("Физика", "09:00"), ("Информатика", "10:40")],
    datetime(2023, 10, 4, 0, 0): [
        ("Физика", "12:40"),
        ("Линейная алгебра ...", "14:20"),
        ("Иностранный язык", "16:20"),
    ],
    datetime(2023, 10, 5, 0, 0): [
        ("Основы ...", "10:40"),
        ("Физическая ...", "12:40"),
        ("Основы ...", "14:20"),
    ],
    datetime(2023, 10, 6, 0, 0): [
        ("Информатика", "09:00"),
        ("Математический ...", "10:40"),
        ("Линейная алгебра ...", "12:40"),
        ("Математический ...", "14:20"),
    ],
    datetime(2023, 10, 7, 0, 0): [
        ("История России", "09:00"),
        ("История России", "10:40"),
        ("Введение в ...", "12:40"),
    ],
    datetime(2023, 10, 8, 0, 0): [],
    datetime(2023, 10, 9, 0, 0): [("Процедурное ...", "09:00"), ("Процедурное ...", "10:40")],
    datetime(2023, 10, 10, 0, 0): [("Физика", "09:00"), ("Информатика", "10:40")],
    datetime(2023, 10, 11, 0, 0): [
        ("Физика", "12:40"),
        ("Линейная алгебра ...", "14:20"),
        ("Иностранный язык", "16:20"),
    ],
    datetime(2023, 10, 12, 0, 0): [
        ("Процедурное ...", "10:40"),
        ("Физическая ...", "12:40"),
        ("Основы ...", "14:20"),
    ],
    datetime(2023, 10, 13, 0, 0): [
        ("Информатика", "09:00"),
        ("Математический ...", "10:40"),
        ("Линейная алгебра ...", "12:40"),
        ("Математический ...", "14:20"),
    ],
    datetime(2023, 10, 14, 0, 0): [
        ("История России", "09:00"),
        ("История России", "10:40"),
        ("Введение в ...", "12:40"),
    ],
    datetime(2023, 10, 15, 0, 0): [],
    datetime(2023, 10, 16, 0, 0): [("Процедурное ...", "09:00"), ("Процедурное ...", "10:40")],
    datetime(2023, 10, 17, 0, 0): [
        ("Физика", "09:00"),
        ("Информатика", "10:40"),
        ("Физика", "12:40"),
        ("Физика", "14:20"),
    ],
    datetime(2023, 10, 18, 0, 0): [
        ("Физика", "12:40"),
        ("Линейная алгебра ...", "14:20"),
        ("Иностранный язык", "16:20"),
    ],
    datetime(2023, 10, 19, 0, 0): [
        ("Основы ...", "10:40"),
        ("Физическая ...", "12:40"),
        ("Основы ...", "14:20"),
    ],
    datetime(2023, 10, 20, 0, 0): [
        ("Информатика", "09:00"),
        ("Математический ...", "10:40"),
        ("Линейная алгебра ...", "12:40"),
        ("Математический ...", "14:20"),
    ],
    datetime(2023, 10, 21, 0, 0): [
        ("История России", "09:00"),
        ("История России", "10:40"),
        ("Введение в ...", "12:40"),
    ],
    datetime(2023, 10, 22, 0, 0): [],
    datetime(2023, 10, 23, 0, 0): [("Процедурное ...", "09:00"), ("Процедурное ...", "10:40")],
    datetime(2023, 10, 24, 0, 0): [("Физика", "09:00"), ("Информатика", "10:40")],
    datetime(2023, 10, 25, 0, 0): [
        ("Физика", "12:40"),
        ("Линейная алгебра ...", "14:20"),
        ("Иностранный язык", "16:20"),
    ],
    datetime(2023, 10, 26, 0, 0): [
        ("Процедурное ...", "10:40"),
        ("Физическая ...", "12:40"),
        ("Основы ...", "14:20"),
    ],
    datetime(2023, 10, 27, 0, 0): [
        ("Информатика", "09:00"),
        ("Математический ...", "10:40"),
        ("Линейная алгебра ...", "12:40"),
        ("Математический ...", "14:20"),
    ],
    datetime(2023, 10, 28, 0, 0): [
        ("История России", "09:00"),
        ("История России", "10:40"),
        ("Введение в ...", "12:40"),
    ],
    datetime(2023, 10, 29, 0, 0): [],
    datetime(2023, 10, 30, 0, 0): [("Процедурное ...", "09:00"), ("Процедурное ...", "10:40")],
}
